# ConduitSize Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize Class
Members See Also
---
Stores the basic size information for a conduit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ConduitSize : IDisposable
```

Visual Basic
---
```text
Public Class ConduitSize _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ConduitSize : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Electrical..::..ConduitSize
# See Also
ConduitSize Members
Autodesk.Revit.DB.Electrical Namespace